{"the-sun":"Make the most of this day, on which everything you turn your hand to will have optimum impact, whether this is regarding family love (a good day for kisses and ‘I love you’ to your special ones), or creativity (working those crafts, or drawings or cooking), or success on any level (your project, job, input), The Sun promises success. Today will bring you great joy, and a wonderful feeling that it is great to be alive. You should feel warm, happy, gracious, loved and, especially, full of gratitude ~ because, guess what? ~ you deserve to be! Enjoy!","the-star":"Fix your eyes on the beauty of The Star. Keep doing all those things you do well, because it really does matter. If you feel like you are getting nowhere, keep following the Star. Hoping for something better will keep you going, and the drip, drip, drip of all your efforts will finally pay off. This is a test of your patience and endurance. By keeping your eyes on the beauty of life, and believing that this is all heading somewhere wonderful, is attesting to the Universe that you are submitting and ready for the good things to start happening. Relax into your life…..trust and hope that the next day will dawn with wonderful new things for you……..there will be a day when this happens, the more you relax the sooner that is likely to be, but only if you keep your eyes on The Star and keep hope in your heart.","the-tower":"Whatever makes your personal Tower fall down today (something that happens that you didn’t see coming), believe it or not, gives you the opportunity to start anew ~ to do it better ~ and to do it BIGGER. You may not have seen this coming, but the Universe did, because it knew this is the right time for you to build your bright, shiny new Tower from scratch. Try to identify which things from the past might have caused your Tower to be weak, and, this time, ensure all the fail-safes are in place, that the foundations are sturdy, so that your next Tower is strong and more enduring against the forces of the unknown.","the-hanged-man":"Today, just stay calm. Step back and think, don’t struggle and fight. Submit to whatever happens; keep calm, and clear headed, before reacting. Forcing an issue is unlikely to bring success, whereas submission and clarity of thought, at this time, will be more productive. A period of reflection is much more likely to bring solutions than kicking and screaming, and patience can often be rewarded in unexpected ways. You don’t need to rush the answer, it will come in good time, and you will have retained your dignity, as well as having gained some insights, by the time you have the ability to move on.","the-fool":"A new task, or new approach to the way you deal with things, is at hand today. The Fool reminds us to be alert and to not go rushing in with total abandon. He asks us to pay attention to detail, to watch out for pitfalls, to make use of past experiences and not make those mistakes again. So, get ready to change your direction in life or, the way you do things: this is your big chance to make a real success of what you are tasked with. New Day, Different Approach, Better Rewards.","the-world":"Today will be a good day. The World is the most positive card in a tarot deck! You will see, and feel incredibly proud, that you have achieved what you set out to do. Today will be a celebration of your success. You will feel happy, secure and full of love for everyone/everything in your life. Bask in the limelight, feel good and be deservedly happy; know that there is nothing you can’t deal with, can’t overcome ~ you are armed with the skills and knowledge that will take you safely through whatever the future brings. What an achievement ~ well done!","the-hermit":"What is it you are seeking? Where are you heading? You may think you know, but there might just be something you are not aware of. Take time for yourself, at some point today, to do some delving about how you feel, about what you want and what is lacking. There is a need to go deep into the cave of your psyche to make sure your light still shines as brightly as it should. Shed all the excess worries and cares that have attached themselves to your shoulders, shake yourself down to the core of your needs and get focused. Remember who you are, why you were heading this way, and what needs to be done to help achieve your goals sooner – nobody else can do it for you. ","the-devil":"So, something has a hold on you? An addiction, a worry, a feeling of guilt, a fear that you can’t break free from. Why can’t you break free? Are you physically chained to this? Actually no, probably not. Nothing is stopping you from breaking free ~ except your perception of this situation. It takes nerves, yes, but it is a battle of wills, and not a full-on battle with The Devil himself. In that context, just think how easily you can beat this if you just adjust your mindset, and be determined to rid yourself of what has been holding you back for far too long. As the saying goes ‘Better the devil you know, than the devil you don’t.’ In other words, you know what you are dealing with, you know what you need to do – you are not facing an unknown demon, and you have the power to overcome this. ","justice":"The scales of Justice are about to fall. It may be regarding a legal wrangling, or an issue which has been troubling you for some time; and, if you have always been honest and clear in your dealings, you should have nothing to fear. Justice should fall on the side of truth and honesty, so hopefully you will reap the rewards of your behaviours. You may be required to just use logic, and intellect, today above all else, to ensure this last step is dealt with properly. However, you will finally be recognised for your worth and your actions will be justified.","the-high-priestess":"Though they cannot be seen right now, nor even felt, things are unfolding in the background for you. Hidden talents will be coming to the fore and it will not be long before you discover a part of you which has developed into something more vibrant, and possibly spiritual, than you could have imagined. It could be the coming together of maturity and wisdom, or the ability to see things differently or more universally, maybe an unknown destiny approaching. The butterfly is almost ready to emerge. Listen carefully to your intuition, it is trying to speak to you. Open yourself to opportunities and ideas, and look out for encouraging signs.","judgement":"If you were to be judged by someone, you felt unfairly, your response might be “But you don’t know my full circumstances! You don’t understand why I felt the way I did!”  The same will apply to other people you may come across today. Should you be in a position to judge someone, try to see beneath the surface, beyond the obvious, to understand that you may not know of all that has brought them to this place, this moment. You would hope that others, who may stand in judgement of you, will do the same and show some understanding, indeed, you may find yourself in this situation today. But the sure-fire solution to being judged fairly, is to act with honesty and integrity, at all times, so that you don’t fall foul of the system.","the-lovers":"Do you not feel totally happy in your love? Do you feel you need more? Then it is time to question why things are not totally right with your current partner, or time to question why something appears to be much more tempting. This may not be a person but a different way of life, perhaps just a different scenario. It is important to look after your own needs, but do remember to be fair to all parties, including yourself, when thinking through this situation…… and don’t do this alone. Communication can change what seems an impossibility into the very possible, as well as vice versa, but will ensure that decisions are not made purely on a whim.","the-hierophant":"If you are sensing feelings of discord about things that you were completely happy about before, it will come as no surprise that you may be seeking alternative information, or beliefs, that may better suit your needs now. You may need to do some research to find what will finally make some sense of your life, or seek out someone who can give you information on what interests you. Do not just follow blindly what is said, but seek out the truth beyond, in any way you can, to ensure you are not being misguided.","the-chariot":"Today you may be pulled in different directions. It is important that you head in the direction you want to, not one that somebody else dictates. It might take a lot of strength to keep heading in the direction of your choice, but that is better than being pulled to and fro and ending up somewhere you don’t want, or need, to be. At least having made a choice, and by sticking to it, you will be heading somewhere specific and you will know that it was your choice. Only you should be in control of where you are heading, because only you know where you want to go.","death":"OK, so it’s over. It may be something/someone that you loved, that has gone, but it might also be an ongoing problem which has been causing you aggravation and upset, which might not be a bad thing. However, it can be incredibly hard to say “That’s it! There is nothing more. I am ready to move on.”, but coming to terms with an ending is a huge first step into the healing process. The sooner you accept this outcome, the sooner the better times will come. Death can never destroy the Day, so the sun will continue to rise, day after day, just as you will feel a little better, day after day, and, if you follow the sun, that is where you will find strength, wisdom and happiness. Don’t dwell on the dark side, stay in the light.","the-magician":"You are faced with a crossroads – which direction to take – and you must choose one. The Magician doesn’t tell you which to take, or what you might encounter on the way, but he does say this: You are very well equipped for this adventure, you have all the skills you need to complete this journey, just have confidence in yourself! This is about choosing a path on which you learn self-respect, and self-confidence, and these steps head towards wisdom and maturity, it will be a worthwhile decision.","the-empress":"You may find yourself focused on a mother/child relationship, or possibly a romance with this dynamic. You may find yourself doing the nurturing, the decision making, or the comforting. By taking on this role you may be having a significant impact on the other person. Remember, that taking on an authoritative role might encourage you to assume your way is the best way, but it is not necessarily so, and you may need to watch your temper if things are not done the way you expect. Be a tender example of the love a mother gives, and not that of a demanding matriarch; keep grounded and be understanding. The love you give out will be returned in full, and then some.","the-emperor":"Drive and determination are available to you today. You will feel ready to strive for the things that you want in your life, and are raring to go and get it. The tarot advises you will need to be wise in your decision making, kind with the people around you, but strong enough to defend yourself, if need be. This is certainly a day for great achievements but remember to not get carried away with your own power. A wise ruler will know when to be understanding and merciful, as well as when to be firm; keep your feet firmly on the ground.","temperance":"There are times when logic and intellect are mostly needed in a particular situation, but now, for you, it is a time when emotion will provide a much needed balance. Not everything can be sorted out with logic alone. Whatever your current issue might be, try to listen to what your heart is telling you to do, or forget what your head is telling you and allow your feelings to guide the way, regardless of what it is. Be emotional, be loving, be honest - pour your heart out. Sometimes this is all that is needed to make things right.","strength":"Pride comes before a fall.’ Being in the frame of mind of ‘I know best’ is likely to make current situations much worse. It would be better if you don’t assume that it’s all about you today. This means that, to get the best out of today, be ready to look at situations from everyone’s angle……..criticisms aimed at you, may help you constructively and kick-start some major improvements in your life, but only if you are prepared to listen. Choose to look at all things today from a humble perspective and you are likely to succeed, whereas pride will trip you up. Be a gentle giant rather than an enormous bully.","the-moon":"The Moon suggests hidden things, unseen machinations and intrigue. Things may well be on the move for you now but all is not quite clear, things are not quite ready for you to be able to make choices. It is not a good time to make major decisions but it is time for you to be more aware of your gut instincts. The Universe has your back, and sends you this card today because it feels you do not have the information you need to make any significant decisions, and you must be wary. Bide your time and use your inner senses to pick out the signs and little snippets of information that are available to you and store them for when this unclear phase passes, when suddenly everything (if you have been alert) will fall into place.","wheel-of-fortune":"Hang on tight! For the Wheel is turning for you. If you have been stuck in a rut or things have been difficult, then an opportunity for improvement is heading your way. Sometimes opportunities come and go without us realising so we miss our chance, and, sometimes, when the Wheel turns, it is just as easy to let go in fear, instead of holding on tightly so it can take us to the top. Stay alert, pay attention to detail in everything you do, and look out for chances to put your hand up and say ‘I’m here, I can do it!’ Then get ready for a new turn in your fortunes, but hang on in there, don’t give up too easily.","ace-of-swords":"A change of attitude, opinion or approach might help you deal with something much better today. Start looking at things a bit differently and you may find things working out a little easier than usual. The minute you feel befuddled take a deep breath and actively tell your brain to look at the issue objectively. Clarity of mind is the order of the day.","two-of-swords":"Any nagging issues should really be faced and dealt with today. You may be hoping that avoiding the problem might encourage it to disappear, but it is better to bite the bullet and get it sorted. There will be fewer complications by sorting things out now. A pleasant demeanour and helpful attitude might make it less of a conflict than you expect it to be.","three-of-swords":"Any disappointments or upsets today are better pigeon-holed as either a battle which was never going to be won, or one of those experiences where you have to say to yourself ‘Well, you live and learn. I won’t fall for that one again!’ Consider it as an additional arrow in your weaponry, you have gained something from this, which can be used in the future. ","four-of-swords":"Time out! You are in need of some rest and self-nurturing. You have walked the walk, and it was tough. Turn your attention to what you need the most…..rest and healing, in whichever way you can. If you can afford it, treat yourself to something nice, if you can’t afford to, then treat yourself to some downtime and special time for you. Give yourself an inspiring pep-talk. You are worth it!","five-of-swords":"Picture this: You are standing in front of a formidable foe, you are tired, hungry and lacking in weapons. The chances are you are not going to win this battle. Is it worth getting beaten to a pulp for the sake of pride, or is it best to walk away and be able to face this conflict another day in another, and better, way? It’s your choice, of course, but some battles are just not worth the casualties, today’s might just be one of these.","six-of-swords":"Just go with the flow today. Things change from day to day. If something seems tough today, it may not do so tomorrow. It might not be possible to get the solutions sorted today, but it is only 24 hours. Take a deep breath and, at least for today, put your worries to one side. Maybe things will be easier to sort out tomorrow.","seven-of-swords":"Porky pies (lies) might be acceptable, or justifiable, in certain situations but there are other times when they are not. Today, make sure you are not tempted to tell a fib to make your life easier, because you might find things get much more complicated. But it might not be you that is fibbing. Be alert to possible untruths being told around you today.","eight-of-swords":"Whatever the problem at hand might be, today, it is worth taking a gentle breath, and attempting to sort it. It is so tempting to ignore it in the hopes that it might go away, but it is not likely to. You may be afraid to face this head-on, but if you don’t confront it, you will be afraid every day until you do. The sooner you deal with it, the less complicated it is likely to be, and you will have more relaxed existence.","nine-of-swords":"You might find yourself beating yourself up today over a situation. Whatever you are thinking, in your mind, about how bad this is, and you feel that it’s all your fault, it is highly likely that others involved don’t think it is all that bad. In other words, you may be making this incredibly harsh for yourself. Get it out in the open and be prepared to find out that it’s only you that is making it unbearable!","ten-of-swords":"Today brings the end of a situation which you have been unhappy about for some time. Maybe you have been clinging on, just hoping for the best. But remember your dignity…………..ask yourself if you can accept the truth, and let things go. If you can, you should pick yourself up off the floor, dust yourself off and head off toward a bright new sunshiny day. ","page-of-swords":"Misinterpretation. Today may well bring a situation to hand in which either something you have said has been misunderstood, or you are misunderstanding what someone has said to you. Therefore, to avoid challenging situations erupting, it would be wise to listen carefully to what people are saying today (and to clarify you have understood correctly), and to ensure that what you say is absolutely clear to those you are speaking to.","knight-of-swords":"You may wish to charge into a situation, on your white horse, and sort everyone out, but ensure you have got all your facts straight before you start a war that was never intended. A person may cross your path, and you may be interested in them, but get to know them well before getting too involved. They might be too shallow minded/immature for your tastes.","queen-of-swords":"Today you may need to be alert and a little more guarded than usual. Use your mind keenly to assess situations and make the most of them. Think through situations, and don’t give away your thought-processes and decisions too easily. Wearing your heart on your sleeve might not be productive in what you are trying to achieve today, whereas being slightly aloof might prompt other people to give more information than they intended to, which could be to your advantage.","king-of-swords":"If you find yourself around someone who says quite hurtful things, really try to understand that it is not their fault they are not good at finesse, AND, that if you can get beyond the upset of their insensitivity towards you, you might find they have said something that you can really benefit from, so hide your heart a little today, and open your ears. You don’t want to miss out on something worthwhile. ","ace-of-cups":"You might see the possibility of a new relationship starting today. It could be a romance, or it could be someone that will enhance your life in a different way, which is always good. You will feel a strong attraction to, and feelings of affinity with, this person who seems to be sent specifically to help you. This is a relationship which is really worth fostering. ","two-of-cups":"A relationship, which you have been involved with recently, should move onto a new level. It is possible it will cement into a real partnership which is rewarding and exciting. Any good relationship is worth nurturing, so don’t take it for granted and make the effort to keep things interesting.","three-of-cups":"A cause for celebration is on the cards for today. It might be an addition to the family, an engagement, a marriage, or something along these lines; whichever it is, it will bring lots of joy and happiness with it, and should be enjoyed to the full. Love is in the air.","four-of-cups":"You may have reached a plateau in your relationship and you might feel bored with the whole thing. Part of the issue might be your own attitude and mindset, and, if you wish things to improve, you should know there is always a reaction to an action. So, think clearly about your needs, and attempt to get things moving again with a positive step.","five-of-cups":"You may be facing upset, or separation, within a relationship, which you find distressing. By focusing on the positives of your partnership, rather than the negatives, there is a good chance it can be repaired. Adopt a different mindset and approach, to bring out the best in both of you and give yourself another chance.","six-of-cups":"You may feel a longing for a relationship that went awry, and wish it could all get back to the way it used to be. There is always a chance to make things work again, but only if both of you have learnt from the past about what went wrong, and why, and what was that worked well. If you bear this in mind, there is a good chance it might succeed.","seven-of-cups":"There may be different ways to handle a current issue in your relationship, and you might have to decide which is the best way to move things forward. Whichever option you go for, make sure your choice is the one you can truly commit to, and put your all into, otherwise it is all just words and will not change a thing.","eight-of-cups":"It may be that you have come to the end of the road in terms of a relationship, and you are feeling hurt and very unhappy. In facing the hurt and accepting that it is over, you will find that you will start healing sooner. If it didn’t work out, it was probably not right for you. ","nine-of-cups":"At last you feel you are in an established relationship and it feels good. Things are going very well and your commitment to each other is paying off. You are happy and, because you have endured pain in the past, this love is balm to your soul, enjoy this wonderful time, you deserve it.","ten-of-cups":"Despite the pain, hurts and difficulties through times, and relationships, past, you are now in a secure, established and committed relationship where you belong. Enjoy all the things this brings to your door: happiness, belonging, reciprocation of love and trust, family, and a wonderful home/love life. Congratulations.","page-of-cups":"You may desire a romantic relationship. You may feel ready. You might just need to sort one thing out first, though: your love of yourself. By truly loving who and what you are, you will find the love-light shines out of your eyes which will attract your true partner. Start with ‘self’ first, before searching for the right ‘one’ for you. Until you know what you really need for yourself, how will you know who can fit the bill?","knight-of-cups":"We can all be idealistic about love, and be ‘in love’ with love, and think that just being in a relationship is what it is all about. But the truth is, the true love of your life is the person who will love you ‘for what you are’ and bring fulfilment to your life. It is better to be wary of any new lovers who come onto the scene until you know them better. If your suitor seems to have one eye on the road all the time, the chances are s/he is not likely to stick around. If s/he is intently fixed on you and how s/he can improve your life, then you are likely to have found a keeper.","queen-of-cups":"In love, confidence in one’s self is very attractive. You may feel threatened by a rival, or you may feel that you have lost your allure. This may be a time to reaffirm who you are, and what your own needs are; to bring out the Queen of Cups who resides within you. Believe in your natural beauty, awaken your native attraction, and fill yourself with confidence and love of who you are, and use all this to make the world fall in love with you.","king-of-cups":"There may be someone around you who seems to be knowledgeable about love, and who tends to intellectualise it and advise/talk about it, rather than be prepared to experience it. This person is not likely to be a prospective partner, since they fear being hurt. This could be you, however, and you might need to consider whether your past relationships are stifling your own progress in love. The choice is yours, of course, but avoiding relationships might mean missing out on the one which could bring you total happiness and contentment.","ace-of-wands":"Energies are high around creative interests for you today. You may find yourself looking for a new project or adventure which might be sparked by a feeling of boredom in your current situation. Don’t dismiss this feeling and open your mind to what you feel drawn to, whether that might be travel, a new home, hobbies, a business idea or project. Permit yourself to daydream about new ideas.","two-of-wands":"Take a much closer look at opportunities which arise today, they have the possibility of turning into something that might bring an added enjoyment to your life, or solutions to difficulties you might be experiencing. Hobbies, projects, travel opportunities, home moves are all possibilities that might excite you, and they are worth looking at. ","three-of-wands":"A task you have been working on, recently, will show early indications of success. Whilst there is still a long way to go, these signs will reassure you that you are on the right path. Your early success should motivate you to work even harder on this task rather than taking what you feel might be a ‘well-earned rest’, if you wish to rise to greater heights.","four-of-wands":"You have reached a stage where you have created an established foundation for your current project/endeavour. This is a significant achievement and you can be proud of yourself. You seem set to achieve much more from it, but take some time to relax and wallow in your initial success before forging on. Well done!","five-of-wands":"You might encounter some hurdles or obstacles on a project/task you are working on which bring you to a dead stop. This calls for some radical thinking, bend your brain as to how you can get over, round or under them: think out all possibilities even those which seem ridiculous. ","six-of-wands":"You will receive concrete validation of your projects/endeavours today, which will be significant enough to convince even those people who doubted your ability to make it work. What you have been working on is now an established and endorsed by others, you should feel very proud of yourself.","seven-of-wands":"You might have lost focus, or motivation, for your endeavours/projects today and find it difficult to be enthusiastic about what you are working on. It would be worth going back to your original idea to see how far you have come already, as this might just give you the kick start you need to get going again.","eight-of-wands":"You may find that, after a period of stagnation and problems, you are feeling enthused, and incredibly creative, about your current endeavours/projects today. This means there is much work to be done but also means you will be tremendously productive. Work it whilst it lasts.","nine-of-wands":"Working so hard may have brought you to a point of exhaustion. It would be a shame to give up now after all that you have put into your project. Keep your eyes on the finish line and give your all to that last push to get this finished. One last sprint to the finish line. You can do this!","ten-of-wands":"You may be feeling the strain of being overburdened. If there is too much to do and not enough of you to do it, it is time to let go of some of the responsibilities by delegating tasks to others, prioritising them in order of importance, and just letting some things go. Welcome what help you can get and don’t be ashamed about it.","page-of-wands":"You have a great idea and want to run with it, but please don’t rush it unnecessarily. Listen to practical, and objective, advice, even if it is not really what you want to hear. Measured steps will help you attain your goal much more than flinging yourself head first into the unknown. Listen and learn.","knight-of-wands":"It might be time to take a steadier and longer lasting approach to your endeavours. It is easy to be distracted by something different and more exciting, but by staying steadfast to your project, you will be creating something much more sustainable and rewarding. You might meet someone today who could possibly give you something you need, at least in the short term. ","queen-of-wands":"You could find yourself successfully completing everything you turn your hand to, today. With a little effort and commitment, nothing should be presented to you that you can’t handle. If there is something beyond your ken, find out about how to do it. Focus on this special touch, today, especially where your skills are needed most, or where they will have the maximum impact for you.","king-of-wands":"You may get some valuable input from someone who is highly capable, driven and ambitious today. This person can give you some inspiration on how to take your endeavours to the next level with surprising results, however, they will not hang around for too long, so make sure you can learn their methods of achievement whilst you have their attention.","ace-of-pentacles":"Be keenly aware of any signs of promotions, jobs, new opportunities, bargains or money-making schemes today because the energy is high around a chance to increase your income or material situation. Do some research and don’t dismiss your ability to get down to it. Sometimes it is easy to ignore something which is in fact a chance we should grab with both hands.","two-of-pentacles":"Help could well be at hand if you are in financial difficulties right now. Be ready, lock your pride in a box, and take any opportunity offered to you today. Accepting help, once, to set you on a journey to more prosperity, will not stigmatise you, but simply give you that one step up on the next ladder rung to success. Don’t let pride stop you.","three-of-pentacles":"A little sign of advancement in your financial situation will give you the encouragement you need today. Of course, there is still hard work to be done, but at least this sign shows you are onto a winner. This should give you the boost you need to carry on.","four-of-pentacles":"You might feel a bit wobbly about a proposition on a financial front. Whilst it is right to protect what you have worked hard for, it is sometimes necessary to take a risk if a suitable opportunity arises. By never taking a risk, you might miss out on something much bigger and better.","five-of-pentacles":"When weighing up your personal financial situation, remember not to lump everything in life with money. Maybe you have been disappointed with something which has badly affected your income, but you have not lost everything in your life….you still have people that love you, your health, your intelligence and ability to rebuild your situation. Don’t throw the baby out with the bathwater – it is only a certain amount of money, don’t think you have lost everything.","six-of-pentacles":"Some sort of bonus, or gift, could be given to you today, something which restores your faith in people and life in general. Whether it is physical money or an opportunity to make some, ensure you make this opportunity work for you in the long term, and don’t see it a ‘throw away’ opportunity. This won’t happen often, make the most of it.","seven-of-pentacles":"If it is necessary to make a financial decision today, do some serious thinking about your past experiences – what went wrong and why, or what has worked well for you,  because these are the tools you have been given to make the best of new opportunities that are sent your way. Make an ‘informed’ decision.","eight-of-pentacles":"You might encounter a need to learn a new skill or to enhance your current skills, through training, today. By following through with this, not only will you enhance your ability to succeed, in this particular field, but you are likely to find it highly enjoyable too, which is a fantastic bonus.","nine-of-pentacles":"Today should bring some reward for all your hard work. Your unique skills have engineered this, and you should be proud of yourself. There is nothing like seeing concrete evidence of hard work and commitment, and you really do deserve this. Enjoy!","ten-of-pentacles":"You are in the enviable position of having a rich, loving and established family and lifestyle. This is down to all your hard work and effort. Today you should feel incredibly happy and satisfied with what you have achieved so far. Long may it last! Well done.","page-of-pentacles":"You may feel a desire to do some research today. Learning something new, or adding to what you already know, can only engineer better opportunities for you. You might even feel that it would be a pleasure to do, rather than it being a chore. Trust your instincts and go for it. It may well pay off.","knight-of-pentacles":"You will achieve much more if you pay attention to detail today. Make sure everything you attend to is done painfully well. Dot all the ‘i’s and cross all the ’t’s, because it is that tiny attention to detail that will bring the success – do it even if people think you are boring. It will pay off. Or, you might meet someone who may not be wholly exciting but who is dedicated and trustworthy.","queen-of-pentacles":"You might need to get focused on your future, and your financial needs, today, if you are sick of not having enough; then make a determined effort about how to get those things. If you wish to provide for those that you love, you must start to think very clearly about what you need, and how to achieve it. Be masterful, determined and clever.","king-of-pentacles":"If there is something you want to achieve – whether it is physical, emotional or financial – there are two things you need to know. One is, if there is something you don’t know about, or don’t understand, then you need to educate yourself or find someone to advise you. The second is, learn how to be ambitious without losing your integrity; go for it but don’t lose your soul in the process. Both these things will yield the fruits you desire."}
